app/controllers/school_classes_controller.rb

    def update
        @school_class = SchoolClass.update(school_class_params)
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "we5124512fw"], ["room_number", 123], ["updated_at", "2021-02-17 00:46:13.494485"], ["id", 1]]